test/src/test/testtool/SoapValidator/HappyFlow/api-out-invalid.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><HelloWorld_Response xmlns="http://api.nn.nl/HelloWorld"><Result xmlns="http://nn.nl/XSD/Generic/MessageHeader/1">
		<Status>ERROR</Status>
		<ErrorList>
			<Error>
				<Code>ERR6003</Code>
				<Reason>Invalid Request</Reason>
				<Service>
					<Name/>
					<Context/>
					<Action>
						<Paradigm>Response</Paradigm>
						<Name>Test/SoapValidator</Name>
						<Version>1</Version>
					</Action>
				</Service>
				<DetailList>
					<Detail>
						<Code>ORIGINAL_MESSAGE</Code>
						<Text>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"&gt; &lt;soapenv:Body&gt; &lt;HelloWorld2_Request xmlns="http://api.nn.nl/HelloWorld"&gt; &lt;Text&gt;hello_to_all&lt;/Text&gt; &lt;/HelloWorld2_Request&gt; &lt;/soapenv:Body&gt; &lt;/soapenv:Envelope&gt;</Text>
					</Detail>
					<Detail>
						<Code>ERROR</Code>
						<Text>/Envelope/Body: Illegal element 'HelloWorld2_Request'. Element(s) 'HelloWorld_Request' expected.</Text>
					</Detail>
					<Detail>
						<Code>ERROR</Code>
						<Text>/Envelope/Body: Element(s) 'HelloWorld_Request' not found</Text>
					</Detail>
				</DetailList>
			</Error>
		</ErrorList>
	</Result></HelloWorld_Response></soapenv:Body></soapenv:Envelope>